chat-app/k6-tests/artillery/simple-test.yml
# Artillery 简单 Socket.IO 连接测试
config:
  target: "http://localhost:3000"
  phases:
    - duration: 10
      arrivalRate: 1
      name: "Quick test"

  engines:
    socketio-v3:
      transports: ["websocket"]
      query:
        token: "{{ token }}"

  processor: "./simple-processor.js"

scenarios:
  - name: "Socket.IO 连接测试"
    engine: socketio-v3
    beforeScenario: "beforeConnect"
    flow:
      # 等待连接
      - think: 2

      # 发送消息
      - emit:
          channel: "send_message"
          data:
            receiverId: "{{ friendId }}"
            type: "text"
            content: "Artillery 测试 {{ $timestamp }}"

      # 等待响应
      - think: 2